#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/0e4e789b-33d8-4f72-b4f9-3e6a29b6815a/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "central-gcp-vpc-non-prod-37070"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "my-new-project-trw0"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-id"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {
      + host_project    = "central-gcp-vpc-non-prod-37070"
      + id              = (known after apply)
      + service_project = "new-luis-id"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:410553540498@cloudservices.gserviceaccount.com"
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-central1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-02"
    }

  # module.project-factory["new-luis"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
        id                  = "projects/new-luis-id"
      ~ name                = "new-luis with space" -> "new-luis"
        # (5 unchanged attributes hidden)
    }

  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prod-project-369617"
      + skip_delete         = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "central-gcp-vpc-non-prod-37070"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "my-new-project-trw0"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis-id"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created%0A  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {%0A      + host_project    = "central-gcp-vpc-non-prod-37070"%0A      + id              = (known after apply)%0A      + service_project = "new-luis-id"%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created%0A  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + member     = "serviceAccount:410553540498@cloudservices.gserviceaccount.com"%0A      + project    = "central-gcp-vpc-non-prod-37070"%0A      + region     = "us-central1"%0A      + role       = "roles/compute.networkUser"%0A      + subnetwork = "subnet-02"%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_project.main will be updated in-place%0A  ~ resource "google_project" "main" {%0A      ~ auto_create_network = true -> false%0A        id                  = "projects/new-luis-id"%0A      ~ name                = "new-luis with space" -> "new-luis"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "prod-project-369617"%0A      + skip_delete         = (known after apply)%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*